stm32f1/vl53l0x_stm32/common/tof/VL53L0X.c
// Most of the functionality of this library is based on the VL53L0X API
// provided by ST (STSW-IMG005), and some of the explanatory comments are quoted
// or paraphrased from the API source code, API user manual (UM2039), and the
// VL53L0X datasheet.

#include <stdio.h>
#include <stdbool.h>
#include "VL53L0X.h"
#pragma GCC diagnostic ignored "-Wsign-conversion"
#include <stm32f10x_i2c.h>
#pragma GCC diagnostic warning "-Wsign-conversion"

#include "../utility.h"

// Defines /////////////////////////////////////////////////////////////////////

// The Arduino two-wire interface uses a 7-bit number for the address,
// and sets the last bit correctly based on reads and writes
#define ADDRESS_DEFAULT 0b0101001

// Record the current time to check an upcoming timeout against
//#define startTimeout() (VL53L0X.timeout_start_ms = millis())
#define startTimeout() (VL53L0X.timeout_start_ms = 0)

// Check if timeout is enabled (set to nonzero value) and has expired
//#define checkTimeoutExpired() (VL53L0X.io_timeout > 0 && ((uint16_t)millis() - VL53L0X.timeout_start_ms) > VL53L0X.io_timeout)
#define checkTimeoutExpired() (0)

// Decode VCSEL (vertical cavity surface emitting laser) pulse period in PCLKs
// from register value
// based on VL53L0X_decode_vcsel_period()
#define decodeVcselPeriod(reg_val)      (((reg_val) + 1) << 1)

// Encode VCSEL pulse period register value from period in PCLKs
// based on VL53L0X_encode_vcsel_period()
#define encodeVcselPeriod(period_pclks) (((period_pclks) >> 1) - 1)

// Calculate macro period in *nanoseconds* from VCSEL period in PCLKs
// based on VL53L0X_calc_macro_period_ps()
// PLL_period_ps = 1655; macro_period_vclks = 2304
#define calcMacroPeriod(vcsel_period_pclks) ((((uint32_t)2304 * (vcsel_period_pclks) * 1655) + 500) / 1000)


static uint16_t VL53L0X_decodeTimeout(uint16_t value);
static uint16_t VL53L0X_encodeTimeout(uint16_t timeout_mclks);
static uint32_t VL53L0X_timeoutMclksToMicroseconds(uint16_t timeout_period_mclks, uint8_t vcsel_period_pclks);
static uint32_t VL53L0X_timeoutMicrosecondsToMclks(uint32_t timeout_period_us, uint8_t vcsel_period_pclks);

//created by me
struct vl53l0x VL53L0X;
static uint16_t temp;


// Constructors ////////////////////////////////////////////////////////////////
/*
VL53L0X_VL53L0X(void)
  : address(ADDRESS_DEFAULT)
  , io_timeout(0) // no timeout
  , did_timeout(false)
{
}
 */
// Public Methods //////////////////////////////////////////////////////////////

void VL53L0X_setAddress(uint8_t new_addr)
{
	VL53L0X_writeReg(I2C_SLAVE_DEVICE_ADDRESS, new_addr & 0x7F);
	VL53L0X.address = new_addr;
}

// Initialize sensor using sequence based on VL53L0X_DataInit(),
// VL53L0X_StaticInit(), and VL53L0X_PerformRefCalibration().
// This function does not perform reference SPAD calibration
// (VL53L0X_PerformRefSpadManagement()), since the API user manual says that it
// is performed by ST on the bare modules; it seems like that should work well
// enough unless a cover glass is added.
// If io_2v8 (optional) is true or not given, the sensor is configured for 2V8
// mode.

bool VL53L0X_init(bool io_2v8)
{
	// VL53L0X_DataInit() begin

	// sensor uses 1V8 mode for I/O by default; switch to 2V8 mode if necessary
	if (io_2v8) {
		VL53L0X_writeReg(VHV_CONFIG_PAD_SCL_SDA__EXTSUP_HV,
				VL53L0X_readReg(VHV_CONFIG_PAD_SCL_SDA__EXTSUP_HV) | 0x01); // set bit 0
	}

	// "Set I2C standard mode"
	VL53L0X_writeReg(0x88, 0x00);

	VL53L0X_writeReg(0x80, 0x01);
	VL53L0X_writeReg(0xFF, 0x01);
	VL53L0X_writeReg(0x00, 0x00);
	VL53L0X.stop_variable = VL53L0X_readReg(0x91);
	VL53L0X_writeReg(0x00, 0x01);
	VL53L0X_writeReg(0xFF, 0x00);
	VL53L0X_writeReg(0x80, 0x00);

	// disable SIGNAL_RATE_MSRC (bit 1) and SIGNAL_RATE_PRE_RANGE (bit 4) limit checks
	VL53L0X_writeReg(MSRC_CONFIG_CONTROL, VL53L0X_readReg(MSRC_CONFIG_CONTROL) | 0x12);

	// set final range signal rate limit to 0.25 MCPS (million counts per second)
	VL53L0X_setSignalRateLimit(0.25);

	VL53L0X_writeReg(SYSTEM_SEQUENCE_CONFIG, 0xFF);

	// VL53L0X_DataInit() end

	// VL53L0X_StaticInit() begin

	uint8_t spad_count;
	bool spad_type_is_aperture;
	if (!VL53L0X_getSpadInfo(&spad_count, &spad_type_is_aperture)) {
		return false;
	}

	// The SPAD map (RefGoodSpadMap) is read by VL53L0X_get_info_from_device() in
	// the API, but the same data seems to be more easily readable from
	// GLOBAL_CONFIG_SPAD_ENABLES_REF_0 through _6, so read it from there
	uint8_t ref_spad_map[6];
	VL53L0X_readMulti(GLOBAL_CONFIG_SPAD_ENABLES_REF_0, ref_spad_map, 6);

	// -- VL53L0X_set_reference_spads() begin (assume NVM values are valid)

	VL53L0X_writeReg(0xFF, 0x01);
	VL53L0X_writeReg(DYNAMIC_SPAD_REF_EN_START_OFFSET, 0x00);
	VL53L0X_writeReg(DYNAMIC_SPAD_NUM_REQUESTED_REF_SPAD, 0x2C);
	VL53L0X_writeReg(0xFF, 0x00);
	VL53L0X_writeReg(GLOBAL_CONFIG_REF_EN_START_SELECT, 0xB4);

	uint8_t first_spad_to_enable = spad_type_is_aperture ? 12 : 0; // 12 is the first aperture spad
	uint8_t spads_enabled = 0;

	for (uint8_t i = 0; i < 48; i++) {
		if (i < first_spad_to_enable || spads_enabled == spad_count) {
			// This bit is lower than the first one that should be enabled, or
			// (reference_spad_count) bits have already been enabled, so zero this bit
			ref_spad_map[i / 8] &= ~(1 << (i % 8));
		} else if ((ref_spad_map[i / 8] >> (i % 8)) & 0x1) {
			spads_enabled++;
		}
	}

	VL53L0X_writeMulti(GLOBAL_CONFIG_SPAD_ENABLES_REF_0, ref_spad_map, 6);

	// -- VL53L0X_set_reference_spads() end

	// -- VL53L0X_load_tuning_settings() begin
	// DefaultTuningSettings from vl53l0x_tuning.h

	VL53L0X_writeReg(0xFF, 0x01);
	VL53L0X_writeReg(0x00, 0x00);

	VL53L0X_writeReg(0xFF, 0x00);
	VL53L0X_writeReg(0x09, 0x00);
	VL53L0X_writeReg(0x10, 0x00);
	VL53L0X_writeReg(0x11, 0x00);

	VL53L0X_writeReg(0x24, 0x01);
	VL53L0X_writeReg(0x25, 0xFF);
	VL53L0X_writeReg(0x75, 0x00);

	VL53L0X_writeReg(0xFF, 0x01);
	VL53L0X_writeReg(0x4E, 0x2C);
	VL53L0X_writeReg(0x48, 0x00);
	VL53L0X_writeReg(0x30, 0x20);

	VL53L0X_writeReg(0xFF, 0x00);
	VL53L0X_writeReg(0x30, 0x09);
	VL53L0X_writeReg(0x54, 0x00);
	VL53L0X_writeReg(0x31, 0x04);
	VL53L0X_writeReg(0x32, 0x03);
	VL53L0X_writeReg(0x40, 0x83);
	VL53L0X_writeReg(0x46, 0x25);
	VL53L0X_writeReg(0x60, 0x00);
	VL53L0X_writeReg(0x27, 0x00);
	VL53L0X_writeReg(0x50, 0x06);
	VL53L0X_writeReg(0x51, 0x00);
	VL53L0X_writeReg(0x52, 0x96);
	VL53L0X_writeReg(0x56, 0x08);
	VL53L0X_writeReg(0x57, 0x30);
	VL53L0X_writeReg(0x61, 0x00);
	VL53L0X_writeReg(0x62, 0x00);
	VL53L0X_writeReg(0x64, 0x00);
	VL53L0X_writeReg(0x65, 0x00);
	VL53L0X_writeReg(0x66, 0xA0);

