stm32f1/vl53l0x_stm32/common/tof/VL53L0X.c
	VL53L0X_writeReg(0xFF, 0x01);
	VL53L0X_writeReg(0x22, 0x32);
	VL53L0X_writeReg(0x47, 0x14);
	VL53L0X_writeReg(0x49, 0xFF);
	VL53L0X_writeReg(0x4A, 0x00);

	VL53L0X_writeReg(0xFF, 0x00);
	VL53L0X_writeReg(0x7A, 0x0A);
	VL53L0X_writeReg(0x7B, 0x00);
	VL53L0X_writeReg(0x78, 0x21);

	VL53L0X_writeReg(0xFF, 0x01);
	VL53L0X_writeReg(0x23, 0x34);
	VL53L0X_writeReg(0x42, 0x00);
	VL53L0X_writeReg(0x44, 0xFF);
	VL53L0X_writeReg(0x45, 0x26);
	VL53L0X_writeReg(0x46, 0x05);
	VL53L0X_writeReg(0x40, 0x40);
	VL53L0X_writeReg(0x0E, 0x06);
	VL53L0X_writeReg(0x20, 0x1A);
	VL53L0X_writeReg(0x43, 0x40);

	VL53L0X_writeReg(0xFF, 0x00);
	VL53L0X_writeReg(0x34, 0x03);
	VL53L0X_writeReg(0x35, 0x44);

	VL53L0X_writeReg(0xFF, 0x01);
	VL53L0X_writeReg(0x31, 0x04);
	VL53L0X_writeReg(0x4B, 0x09);
	VL53L0X_writeReg(0x4C, 0x05);
	VL53L0X_writeReg(0x4D, 0x04);

	VL53L0X_writeReg(0xFF, 0x00);
	VL53L0X_writeReg(0x44, 0x00);
	VL53L0X_writeReg(0x45, 0x20);
	VL53L0X_writeReg(0x47, 0x08);
	VL53L0X_writeReg(0x48, 0x28);
	VL53L0X_writeReg(0x67, 0x00);
	VL53L0X_writeReg(0x70, 0x04);
	VL53L0X_writeReg(0x71, 0x01);
	VL53L0X_writeReg(0x72, 0xFE);
	VL53L0X_writeReg(0x76, 0x00);
	VL53L0X_writeReg(0x77, 0x00);

	VL53L0X_writeReg(0xFF, 0x01);
	VL53L0X_writeReg(0x0D, 0x01);

	VL53L0X_writeReg(0xFF, 0x00);
	VL53L0X_writeReg(0x80, 0x01);
	VL53L0X_writeReg(0x01, 0xF8);

	VL53L0X_writeReg(0xFF, 0x01);
	VL53L0X_writeReg(0x8E, 0x01);
	VL53L0X_writeReg(0x00, 0x01);
	VL53L0X_writeReg(0xFF, 0x00);
	VL53L0X_writeReg(0x80, 0x00);

	// -- VL53L0X_load_tuning_settings() end

	// "Set interrupt config to new sample ready"
	// -- VL53L0X_SetGpioConfig() begin

	VL53L0X_writeReg(SYSTEM_INTERRUPT_CONFIG_GPIO, 0x04);
	VL53L0X_writeReg(GPIO_HV_MUX_ACTIVE_HIGH, (uint8_t) (VL53L0X_readReg(GPIO_HV_MUX_ACTIVE_HIGH) & ~0x10)); // active low
	VL53L0X_writeReg(SYSTEM_INTERRUPT_CLEAR, 0x01);

	// -- VL53L0X_SetGpioConfig() end

	VL53L0X.measurement_timing_budget_us = VL53L0X_getMeasurementTimingBudget();

	// "Disable MSRC and TCC by default"
	// MSRC = Minimum Signal Rate Check
	// TCC = Target CentreCheck
	// -- VL53L0X_SetSequenceStepEnable() begin

	VL53L0X_writeReg(SYSTEM_SEQUENCE_CONFIG, 0xE8);

	// -- VL53L0X_SetSequenceStepEnable() end

	// "Recalculate timing budget"
	VL53L0X_setMeasurementTimingBudget(VL53L0X.measurement_timing_budget_us);

	// VL53L0X_StaticInit() end

	// VL53L0X_PerformRefCalibration() begin (VL53L0X_perform_ref_calibration())

	// -- VL53L0X_perform_vhv_calibration() begin

	VL53L0X_writeReg(SYSTEM_SEQUENCE_CONFIG, 0x01);
	if (!VL53L0X_performSingleRefCalibration(0x40)) {
		return false;
	}

	// -- VL53L0X_perform_vhv_calibration() end

	// -- VL53L0X_perform_phase_calibration() begin

	VL53L0X_writeReg(SYSTEM_SEQUENCE_CONFIG, 0x02);
	if (!VL53L0X_performSingleRefCalibration(0x00)) {
		return false;
	}

	// -- VL53L0X_perform_phase_calibration() end

	// "restore the previous Sequence Config"
	VL53L0X_writeReg(SYSTEM_SEQUENCE_CONFIG, 0xE8);

	// VL53L0X_PerformRefCalibration() end

	return true;
}

// Write an 8-bit register

void VL53L0X_writeReg(uint8_t reg, uint8_t value)
{
	//while (I2C_GetFlagStatus(I2C1, I2C_FLAG_BUSY));
	I2C_GenerateSTART(I2C1, ENABLE);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT));
	I2C_Send7bitAddress(I2C1, VL53L0X.address, I2C_Direction_Transmitter);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));
	I2C_SendData(I2C1, reg);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
	I2C_SendData(I2C1, value);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));

	//last_status = Wire.endTransmission();  //what??
	I2C_GenerateSTOP(I2C1, ENABLE);
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF));
}

// Write a 16-bit register

void VL53L0X_writeReg16Bit(uint8_t reg, uint16_t value)
{
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_BUSY));
	I2C_GenerateSTART(I2C1, ENABLE);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT));
	I2C_Send7bitAddress(I2C1, VL53L0X.address, I2C_Direction_Transmitter);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));
	I2C_SendData(I2C1, reg);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));

	for (size_t i = 2; i > 0; i--) {
		I2C_SendData(I2C1, (uint8_t) (value >> (i - 1)) & 0xFF);
		while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
	}

	//last_status = Wire.endTransmission(); //what??
	I2C_GenerateSTOP(I2C1, ENABLE);
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF));

}

// Write a 32-bit register

void VL53L0X_writeReg32Bit(uint8_t reg, uint32_t value)
{
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_BUSY));
	I2C_GenerateSTART(I2C1, ENABLE);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT));
	I2C_Send7bitAddress(I2C1, VL53L0X.address, I2C_Direction_Transmitter);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));
	I2C_SendData(I2C1, reg);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));

	for (size_t i = 4; i > 0; i--) {
		I2C_SendData(I2C1, (uint8_t) (value >> (i - 1)) & 0xFF);
		while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
	}

	//last_status = Wire.endTransmission();
	I2C_GenerateSTOP(I2C1, ENABLE);
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF));
}

// Read an 8-bit register

uint8_t VL53L0X_readReg(uint8_t reg)
{
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_BUSY));
	I2C_GenerateSTART(I2C1, ENABLE);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT));
	I2C_Send7bitAddress(I2C1, VL53L0X.address, I2C_Direction_Transmitter);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));
	I2C_SendData(I2C1, reg);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
	I2C_GenerateSTOP(I2C1, ENABLE);
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF));

	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_BUSY));
	I2C_GenerateSTART(I2C1, ENABLE);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT));
	I2C_Send7bitAddress(I2C1, VL53L0X.address, I2C_Direction_Receiver);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED));
	I2C_AcknowledgeConfig(I2C1, DISABLE);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_RECEIVED));
	uint8_t value = I2C_ReceiveData(I2C1);
	temp = I2C1->SR2;
	I2C_GenerateSTOP(I2C1, ENABLE);
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF));
	I2C_AcknowledgeConfig(I2C1, ENABLE);

	if (I2C_GetFlagStatus(I2C1, I2C_FLAG_BERR)) inform_error();

	return value;
}

// Read a 16-bit register

uint16_t VL53L0X_readReg16Bit(uint8_t reg)
{
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_BUSY));
	I2C_GenerateSTART(I2C1, ENABLE);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT));
	I2C_Send7bitAddress(I2C1, VL53L0X.address, I2C_Direction_Transmitter);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));
	I2C_SendData(I2C1, reg);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
	//last_status = Wire.endTransmission();
	I2C_GenerateSTOP(I2C1, ENABLE);
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF));

	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_BUSY));
	I2C_GenerateSTART(I2C1, ENABLE);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT));
	I2C_Send7bitAddress(I2C1, VL53L0X.address, I2C_Direction_Receiver);
	while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED));

	uint16_t value = 0;
	for (size_t i = 2; i > 0; i--) {
		if (i == 1) {
			I2C_AcknowledgeConfig(I2C1, DISABLE);
		}
		while (!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_RECEIVED));
		value |= (uint16_t) (I2C_ReceiveData(I2C1) << (8 * (i - 1)));
	}
	temp = I2C1->SR2;
	I2C_GenerateSTOP(I2C1, ENABLE);
	while (I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF));
	I2C_AcknowledgeConfig(I2C1, ENABLE);

	return value;
}

